<script setup lang="ts">
import type { TabsItem, TimelineItem } from '@nuxt/ui';

const toggle = computed(() => {});

const tabsItems = ref<TabsItem[]>([
  {
    label: 'История разработки',
    icon: 'lucide:history',
  },
  {
    label: 'Как это работает? (Cкоро)',
    icon: 'lucide:presentation',
    disabled: true,
  },
]);

const historyItems = ref<TimelineItem[]>([
  {
    date: '2 июля 2025',
    title: 'Работа над бэкендом и вёрсткой',
    description:
      'Планируется реализовать добавление постов в разделе «Сеть», редактирование данных пользователя через профиль и другие улучшения. Также — оформление ленты в разделе «Сеть» в стиле Twitter.',
    icon: 'i-lucide-rocket',
  },
  {
    date: '1 июля 2025',
    title: 'Хронология разработки, свайп-меню',
    description: `Добавлена временная шкала разработки, чтобы заинтересованные могли наблюдать за процессом в реальном времени. 
      Удобное и интуитивное свайп-меню, открывающееся при движении пальцем слева направо на мобильных устройствах.`,
    icon: 'lucide:square-menu',
  },
  {
    date: '13 июня 2025 - 30 июня 2025',
    title: 'Цикл разработки',
    description:
      'Разработка frontend и backend. Реализованы основные функции и интегрированы с API. Добавлен автодеплой (GitHub Actions).',
    icon: 'lucide:code',
  },
  {
    date: '13 июня 2025',
    title: 'Начало разработки Omni app',
    description: 'Первый запуск.',
    icon: 'lucide:rocket',
  },
]);
</script>

<template>
  <div
    class="w-full h-[calc(100vh-105px)] sm:h-[calc(100vh-56px)] relative flex justify-center sm:p-4"
  >
    <UCard
      class="w-2xl rounded-none ring-0 sm:rounded-lg sm:ring-1 flex flex-col-reverse sm:flex-col"
      :ui="{
        header: 'border-t sm:border-t-0 flex flex-col gap-4',
        body: 'flex-1 scrollbar-w-1 sm:scrollbar scrollbar-thumb-sky-700 overflow-y-scroll',
      }"
    >
      <template #header>
        <div v-if="$device.isDesktop" class="text-center">
          <h1 class="text-xl mb-4">
            Здесь теперь доступна история разработки, а вскоре появится презентация «Как это
            работает?».
          </h1>
          <p>А чтобы не скучать — загляни в раздел новостей или включи радио в Музыке 🎧</p>
        </div>
        <UTabs :items="tabsItems" color="secondary" />
      </template>
      <UTimeline :items="historyItems" color="secondary" :default-value="2" reverse />
      <template #footer v-if="!$device.isDesktop">
        <div class="text-center">
          <h1 class="text-xl mb-4">
            Здесь теперь доступна история разработки, а вскоре появится презентация «Как это
            работает?».
          </h1>
          <p>А чтобы не скучать — загляни в раздел новостей или включи радио в Музыке 🎧</p>
        </div>
      </template>
    </UCard>
  </div>
</template>
